Tekla.Structures.AnalysisInternal.DotAnalysisNode.analysisObject
The analysis object

Tekla.Structures.AnalysisInternal.DotAnalysisNode.coordinateSystem
The coordinate system of the analysis node.

Tekla.Structures.AnalysisInternal.DotAnalysisNode.label
The label of the analysis node.

Tekla.Structures.AnalysisInternal.DotAnalysisNode.position
The position of the analysis node.

Tekla.Structures.AnalysisInternal.DotAnalysisNode.support
The support of the analysis node.

Tekla.Structures.AnalysisInternal.DotAnalysisNode.isUserNode
This indicates whether the analysis node is a user node.

Tekla.Structures.AnalysisInternal.DotAnalysisNode.isUserSupport
This indicates whether the analysis node ha a user node.